## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 2 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                  |
|----------|--------------------------------------------------------------------------------------------------------|
| add      | `module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                         |
|          | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                                   |
|          | `module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                     |
|          | `module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                   |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                     |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]`    |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]`    |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2]`    |
|          | `module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth`                                  |
| delete   | `module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|          | `module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda`                                |
|          | `module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda`                                  |
|          | `module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|          | `module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                  |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]` |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2]` |
|          | `module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth`                               |
| update   | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`                                         |
|          | `aws_wafv2_web_acl.notification-canada-ca`                                                             |
| recreate | `aws_cloudwatch_log_subscription_filter.admin_api_request`                                             |
|          | `aws_cloudwatch_log_subscription_filter.blazer_logging`                                                |
|          | `aws_cloudwatch_log_subscription_filter.client_vpn_connections`                                        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.admin_api_request must be replaced
  # (moved from aws_cloudwatch_log_subscription_filter.admin_api_request[0])
-/+ resource "aws_cloudwatch_log_subscription_filter" "admin_api_request" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2337749455" -> (known after apply)
        name            = "Admin API request"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.blazer_logging must be replaced
  # (moved from aws_cloudwatch_log_subscription_filter.blazer_logging[0])
-/+ resource "aws_cloudwatch_log_subscription_filter" "blazer_logging" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-1214848348" -> (known after apply)
        name            = "Blazer logging"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.client_vpn_connections must be replaced
  # (moved from aws_cloudwatch_log_subscription_filter.client_vpn_connections[0])
-/+ resource "aws_cloudwatch_log_subscription_filter" "client_vpn_connections" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-982387025" -> (known after apply)
        name            = "Client VPN connections"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                   = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version      = "1.29.0-20240415" -> "1.29.3-20240424"
        tags                 = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id            = "0426a443-20b4-423d-be00-626fc7400dac"
        name          = "notification-canada-ca-waf"
        tags          = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (6 unchanged attributes hidden)

      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (7 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sentinel-cloud-watch-forwarder"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-production"
        }
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-cloud-watch-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:131",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-watch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/containerinsights/notification-canada-ca-production-eks-cluster/application:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0"
      + statement_id_prefix = (known after apply)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-watch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:296255494825:log-group:blazer:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1"
      + statement_id_prefix = (known after apply)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-watch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/client-vpn-endpoint/private-subnets:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-2"
      + statement_id_prefix = (known after apply)
    }

  # module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth will be created
  + resource "aws_ssm_parameter" "sentinel_forwarder_auth" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "sentinel-cloud-watch-forwarder-auth"
      + tags           = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tags_all       = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - id                = "/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
      - tags_all          = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
    }

  # module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      - arn       = "arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - id        = "arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - name      = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/sentinel-cloud-watch-forwarder:*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:296255494825:parameter/sentinel-cloud-watch-forwarder-auth"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAUJ6RUDKU7X5HOF5ZQ" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_iam_role" "sentinel_forwarder_lambda" {
      - arn                   = "arn:aws:iam::296255494825:role/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-01-23T13:13:43Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUJ6RUDKUV4HLRDMEW" -> null
    }

  # module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      - id         = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder-arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - policy_arn = "arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - role       = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
    }

  # module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_lambda_function" "sentinel_forwarder" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" -> null
      - description                    = "Lambda function to forward AWS logs to Azure Sentinel" -> null
      - filename                       = "/tmp/sentinel_forwarder.py.zip" -> null
      - function_name                  = "sentinel-cloud-watch-forwarder" -> null
      - handler                        = "sentinel_forwarder.lambda_handler" -> null
      - id                             = "sentinel-cloud-watch-forwarder" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder/invocations" -> null
      - last_modified                  = "2024-04-15T13:55:53.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:126",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::296255494825:role/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - runtime                        = "python3.9" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE=" -> null
      - source_code_size               = 781 -> null
      - tags                           = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "LOG_TYPE"                 = "ApplicationLog"
              - "SENTINEL_AUTH_PARAMS_ARN" = "arn:aws:ssm:ca-central-1:296255494825:parameter/sentinel-cloud-watch-forwarder-auth"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format = "Text" -> null
          - log_group  = "/aws/lambda/sentinel-cloud-watch-forwarder" -> null
        }

      - tracing_config {
          - mode = "Active" -> null
        }
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "sentinel-cloud-watch-forwarder" -> null
      - id            = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0" -> null
      - principal     = "logs.ca-central-1.amazonaws.com" -> null
      - source_arn    = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/containerinsights/notification-canada-ca-production-eks-cluster/application:*" -> null
      - statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0" -> null
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "sentinel-cloud-watch-forwarder" -> null
      - id            = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1" -> null
      - principal     = "logs.ca-central-1.amazonaws.com" -> null
      - source_arn    = "arn:aws:logs:ca-central-1:296255494825:log-group:blazer:*" -> null
      - statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1" -> null
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2] will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "sentinel-cloud-watch-forwarder" -> null
      - id            = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-2" -> null
      - principal     = "logs.ca-central-1.amazonaws.com" -> null
      - source_arn    = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/client-vpn-endpoint/private-subnets:*" -> null
      - statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-2" -> null
    }

  # module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth will be destroyed
  # (because module.sentinel_forwarder[0] is not in configuration)
  - resource "aws_ssm_parameter" "sentinel_forwarder_auth" {
      - arn       = "arn:aws:ssm:ca-central-1:296255494825:parameter/sentinel-cloud-watch-forwarder-auth" -> null
      - data_type = "text" -> null
      - id        = "sentinel-cloud-watch-forwarder-auth" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "sentinel-cloud-watch-forwarder-auth" -> null
      - tags      = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
      - tags_all  = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

Plan: 12 to add, 2 to change, 12 to destroy.

Changes to Outputs:
  ~ sentinel_forwarder_cloudwatch_lambda_arn  = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
